posts/long-lost-wallet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Finding your long lost hot wallet</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/asset/css/style.css"/><link rel="stylesheet" href="/asset/css/prism.css"/></head>
<body>
<div id="content" class="content">
<h1 class="title">Finding your long lost hot wallet</h1>
<p>
Let's say that you did something silly like use a spare old computer for all your hot wallet needs and forget to back up the mnemonic seed phrase. This blog is for you, fortunately someone else did all the hard work already and also did us all the favour of writing it all up here.
</p>

<p>
<a href="https://medium.com/coinmonks/lost-metamask-wallet-the-forensic-way-c1871c3768f3">https://medium.com/coinmonks/lost-metamask-wallet-the-forensic-way-c1871c3768f3</a>
</p>

<p>
Check it out its great!.
</p>

<p>
I simply wanted to add a few more details to this article and specify how to use the foremost program to search your hard drive.
</p>

<p>
<b><b>Skip</b></b> most of the article and get to the <b><b>foremost</b></b> section.
</p>

<p>
Instead of editing your foremost configuration <code>/etc/formost.conf</code> like so:
</p>
<div class="org-src-container">
<pre><code class="src language-shell">snappy y 900000 \xff\x06\x00\x00\x73\x4e\x61\x50\x70\x59\x00 x\xea\x82\xa2\x00
</code></pre>
</div>

<p>
Replace the size of file with a random assortment of numbers that is larger than 900kb instead of capping it to 900kb:
</p>
<div class="org-src-container">
<pre><code class="src language-shell">snappy y 1000000000000 \xff\x06\x00\x00\x73\x4e\x61\x50\x70\x59\x00 x\xea\x82\xa2\x00
</code></pre>
</div>

<p>
This is important because the size of the file is effectively unlimited, as foremost either uses the size <b><b>or</b></b> the footer as the delimiter. Therefore, you want the program to depend on using the footer, rather than the size otherwise this may cause you to potentially miss your hot wallet file.
</p>

<p>
Then run the program as so:
</p>
<div class="org-src-container">
<pre><code class="src language-shell">sudo foremost -v -i &lt;dismounted internal hard drive&gt; -o /&lt;location of external hard drive&gt; -c /etc/foremost.conf
</code></pre>
</div>

<p>
The program will spit out an ungodly amount of files in the midst of searching and most of the files will just be copies of each other. This is why I recommend attaching an empty external hard drive, and not depend on the storage size of the live USB that you will be mounting.
</p>

<p>
After completing this step, follow the rest of the article that further guides you on how to de-compress your compressed snappy files into text files. Then you will specifically be looking for files that are approximately <b><b>1-3mb</b></b> in size. So click through them manually and CTRL + F for words like "vault" or "keyring" and eventually you will find your file.
</p>

<p>
You may have to do further work in cleaning up the file and removing any non ASCII characters, for the vault to finally fit the specifications of the metamask vault decrypter.
</p>

<p>
Hopefully, after all this work you too will also have found the private key of your long lost wallet.
</p>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
